# 5. Реализовать структуру «Рейтинг», представляющую собой не возрастающий набор натуральных чисел. У пользователя необходимо запрашивать новый элемент рейтинга. Если в рейтинге существуют элементы с одинаковыми значениями, то новый элемент с тем же значением должен разместиться после них.
# Подсказка. Например, набор натуральных чисел: 7, 5, 3, 3, 2.
# Пользователь ввел число 3. Результат: 7, 5, 3, 3, 3, 2.
# Пользователь ввел число 8. Результат: 8, 7, 5, 3, 3, 2.
# Пользователь ввел число 1. Результат: 7, 5, 3, 3, 2, 1.
# Набор натуральных чисел можно задать непосредственно в коде, например, my_list = [7, 5, 3, 3, 2].
ex = [101, 99, 88, 88, 7, 4]
ma = max(ex)

n = int(input())

if n in ex:
    f = [i for i in range(0, len(ex)) if ex[i] == n]
    m = max(f) + 1
    ex.insert(m, n)
    f.clear()
else:
    if n > ma:
        ex.insert(0, n)
    else:
        ex.append(n)
print(ex)